fe40/tutorials/rheoInterFoam/DieSwell/GiesekusLog/0/alpha1.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
       type            fixedValue;
       value           uniform 1;
    }
    
    outlet
    {
       type            zeroGradient;
    }
    
    wallIn
    {
       type            zeroGradient;
    }
    
    wallOut
    {
       type            fixedValue;
       value           uniform 0;
    }
    
    atmosphere
    {
       type            zeroGradient;
    }
    
    symmetry
    {
       type            symmetryPlane;
    }
}
 
