fe40/tutorials/rheoInterFoam/DieSwell/GiesekusLog/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   inlet
    {
      type            zeroGradient;
    }
    
    outlet
    {
       type           zeroGradient;
    }
    
    wallIn
    {
        type          zeroGradient;
    }
    
    wallOut
    {
       type           zeroGradient;
    }
    
    atmosphere
    {
       type           fixedValue;
       value          uniform 0;
    }
    
    symmetry
    {
       type           symmetryPlane;
    }
}
