fe40/tutorials/rheoInterFoam/DieSwell/GiesekusLog/0/tau1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
   inlet
    {
       type            fixedValue;
       value           uniform (0 0 0 0 0 0);
    }
    
    outlet
    {
       type            zeroGradient;
    }
    
    wallIn
    {
       type            linearExtrapolation;
       value           uniform (0 0 0 0 0 0);
    }
    
    wallOut
    {
       type            zeroGradient;
    }
    
    atmosphere
    {
         type            zeroGradient;
    }
    
    symmetry
    {
       type            symmetryPlane;
    }
}
