fe40/tutorials/rheoInterFoam/DieSwell/GiesekusLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          15;
        startFace       24078;
    }
    wallIn
    {
        type            wall;
        nFaces          130;
        startFace       24093;
    }
    wallOut
    {
        type            wall;
        nFaces          37;
        startFace       24223;
    }
    atmosphere
    {
        type            patch;
        nFaces          237;
        startFace       24260;
    }
    outlet
    {
        type            patch;
        nFaces          55;
        startFace       24497;
    }
    symmetry
    {
        type            symmetryPlane;
        nFaces          290;
        startFace       24552;
    }
    defaultFaces
    {
        type            empty;
        nFaces          24460;
        startFace       24842;
    }
)

// ************************************************************************* //
